uhnp/src/Documents/ПравилаЗаменыНоменклатуры/ПравилаЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПравилаЗаменыНоменклатуры</name>
  <registerRecords>InformationRegister.НастройкаЗаменыНоменклатурыЗакупок</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатурыЗакупок/НастройкаЗаменыНоменклатурыЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаменыНоменклатурыЗакупок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗамены</name>
    <type>
      <types>EnumRef.СпособыЗаменыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсточник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИсточник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияИсточник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПриемник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПриемник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПриемник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыЗаменыНоменклатуры/СпособыЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаменыНоменклатуры</name>
  <enumValues>
    <name>ПересчетЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>Унификат</name>
  </enumValues>
  <enumValues>
    <name>Аналоги</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПравилаЗаменыНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ЗаменаНаУнификатыНоменклатураИсточник.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.МассивЗначений(Тип("СправочникСсылка.Номенклатура")));      
	Элементы.ЗаменаНаУнификатыНоменклатураПриемник.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.МассивЗначений(Тип("СправочникСсылка.Номенклатура"))); 
	Элементы.ЗаменаНаАналогиНоменклатураИсточник.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.МассивЗначений(Тип("СправочникСсылка.Номенклатура")));
	Элементы.ЗаменаНаАналогиПриемникНоменклатураПриемник.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.МассивЗначений(Тип("СправочникСсылка.Номенклатура")));
	УстановитьУсловноеОформление();
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаЗаменыНоменклатурыЗакупок.Период КАК Период,
		|	НастройкаЗаменыНоменклатурыЗакупок.Регистратор КАК Регистратор,
		|	НастройкаЗаменыНоменклатурыЗакупок.НомерСтроки КАК НомерСтроки,
		|	НастройкаЗаменыНоменклатурыЗакупок.Активность КАК Активность,
		|	НастройкаЗаменыНоменклатурыЗакупок.СпособЗамены КАК СпособЗамены,
		|	НастройкаЗаменыНоменклатурыЗакупок.НоменклатураИсточник КАК НоменклатураИсточник,
		|	НастройкаЗаменыНоменклатурыЗакупок.ХарактеристикаИсточник КАК ХарактеристикаИсточник,
		|	НастройкаЗаменыНоменклатурыЗакупок.ЕдиницаИзмеренияИсточник КАК ЕдиницаИзмеренияИсточник,
		|	НастройкаЗаменыНоменклатурыЗакупок.НоменклатураПриемник КАК НоменклатураПриемник,
		|	НастройкаЗаменыНоменклатурыЗакупок.ХарактеристикаПриемник КАК ХарактеристикаПриемник,
		|	НастройкаЗаменыНоменклатурыЗакупок.ЕдиницаИзмеренияПриемник КАК ЕдиницаИзмеренияПриемник,
		|	НастройкаЗаменыНоменклатурыЗакупок.Коэффициент КАК Коэффициент,
		|	НастройкаЗаменыНоменклатурыЗакупок.НоменклатураИсточник.ИспользованиеХарактеристик КАК НоменклатураИсточникИспользованиеХарактеристик,
		|	НастройкаЗаменыНоменклатурыЗакупок.НоменклатураПриемник.ИспользованиеХарактеристик КАК НоменклатураПриемникИспользованиеХарактеристик
		|ИЗ
		|	РегистрСведений.НастройкаЗаменыНоменклатурыЗакупок КАК НастройкаЗаменыНоменклатурыЗакупок
		|ГДЕ
		|	НастройкаЗаменыНоменклатурыЗакупок.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ПоискЗамены = Новый Структура("НоменклатураИсточник, ХарактеристикаИсточник, ЕдиницаИзмеренияИсточник, Коэффициент");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                     
		
		Если ВыборкаДетальныеЗаписи.СпособЗамены = Перечисления.СпособыЗаменыНоменклатуры.Унификат Тогда 
			нстр = ЭтотОбъект.ЗаменаНаУнификаты.Добавить();
			ЗаполнитьЗначенияСвойств(нстр, ВыборкаДетальныеЗаписи);  
			нстр.ХарактеристикаИсточникИспользуется = УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ДаХарактеристикиИспользуются(ВыборкаДетальныеЗаписи.НоменклатураИсточникИспользованиеХарактеристик); 
			нстр.ХарактеристикаПриемникИспользуется = УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ДаХарактеристикиИспользуются(ВыборкаДетальныеЗаписи.НоменклатураПриемникИспользованиеХарактеристик);
		КонецЕсли;    
		
		Если ВыборкаДетальныеЗаписи.СпособЗамены = Перечисления.СпособыЗаменыНоменклатуры.Аналоги Тогда 
			
			ЗаполнитьЗначенияСвойств(ПоискЗамены, ВыборкаДетальныеЗаписи);
			Источники = ЭтотОбъект.ЗаменаНаАналоги.НайтиСтроки(ПоискЗамены);
			Если Источники.Количество() = 0 Тогда
				Источник = ЭтотОбъект.ЗаменаНаАналоги.Добавить();
				ЗаполнитьЗначенияСвойств(Источник, ВыборкаДетальныеЗаписи);
				Источник.Идентификатор = Новый УникальныйИдентификатор;  
				Источник.ХарактеристикаИсточникИспользуется = УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ДаХарактеристикиИспользуются(ВыборкаДетальныеЗаписи.НоменклатураИсточникИспользованиеХарактеристик);
			Иначе
				Источник = Источники[0];
			КонецЕсли;

			нстр = ЭтотОбъект.ЗаменаНаАналогиПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(нстр, ВыборкаДетальныеЗаписи);  
			нстр.Идентификатор = Источник.Идентификатор;
			нстр.ХарактеристикаПриемникИспользуется = УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ДаХарактеристикиИспользуются(ВыборкаДетальныеЗаписи.НоменклатураПриемникИспользованиеХарактеристик);
						
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаменаНаУнификаты", 	ЗаменаНаУнификаты.Выгрузить());     
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаменаНаАналоги", 	ЗаменаНаАналогиПриемник.Выгрузить());    
КонецПроцедуры

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции 


&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект, 
																   "ЗаменаНаУнификатыХарактеристикаИсточник", 
                                                                   "ЗаменаНаУнификаты.ХарактеристикаИсточникИспользуется");
   	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект, 
																   "ЗаменаНаУнификатыХарактеристикаПриемник", 
                                                                   "ЗаменаНаУнификаты.ХарактеристикаПриемникИспользуется");
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект, 
																   "ЗаменаНаАналогиХарактеристикаИсточник", 
                                                                   "ЗаменаНаАналоги.ХарактеристикаИсточникИспользуется");
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект, 
																   "ЗаменаНаАналогиПриемникХарактеристикаПриемник", 
                                                                   "ЗаменаНаАналогиПриемник.ХарактеристикаПриемникИспользуется");

КонецПроцедуры  

&НаКлиенте
Процедура ЗаменаНоменклатураПриИзменении(Элемент)     

	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;    
	Если СтрНайти(Элемент.Имя, "ЗаменаНаУнификаты") > 0 Тогда  
		ИмяЭлемента = СтрЗаменить(Элемент.Имя, "ЗаменаНаУнификаты", ""); 
		ИмяТаблицы = "ЗаменаНаУнификаты";   
	ИначеЕсли СтрНайти(Элемент.Имя, "ЗаменаНаАналогиПриемник") > 0 Тогда 
		ИмяЭлемента = СтрЗаменить(Элемент.Имя, "ЗаменаНаАналогиПриемник", "");  
		ИмяТаблицы = "ЗаменаНаАналогиПриемник";
	ИначеЕсли СтрНайти(Элемент.Имя, "ЗаменаНаАналоги") > 0 Тогда 
		ИмяЭлемента = СтрЗаменить(Элемент.Имя, "ЗаменаНаАналоги", "");  
		ИмяТаблицы = "ЗаменаНаАналоги";
	Иначе
		Возврат;
	КонецЕсли;  
	Если СтрНайти(Элемент.Имя, "Источник") > 0 Тогда  
		ИсточникПриемник = "Источник";
	ИначеЕсли СтрНайти(Элемент.Имя, "Приемник") > 0 Тогда 
		ИсточникПриемник = "Приемник";
	Иначе
		Возврат;
	КонецЕсли;       
	
	УстановитьСвойстваТекущихДанных(ИмяЭлемента, ИсточникПриемник, ИмяТаблицы, ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваТекущихДанных(Знач ИмяЭлемента, Знач ИсточникПриемник, Знач ИмяТаблицы, Знач Идентификатор)  
	
	Перем ИспользоватьХарактеристики;   
	
	ТекущиеДанные = ЭтотОбъект[ИмяТаблицы].НайтиПоИдентификатору(Идентификатор);
	
	ИспользоватьХарактеристики = ОпределитьХарактеристикиИспользуются(ТекущиеДанные[ИмяЭлемента]);  
	ТекущиеДанные["Характеристика"+ИсточникПриемник+"Используется"] = ИспользоватьХарактеристики;
	ТекущиеДанные["Характеристика"+ИсточникПриемник] = Неопределено;    
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные["ЕдиницаИзмерения"+ИсточникПриемник]) Тогда
		ТекущиеДанные["ЕдиницаИзмерения"+ИсточникПриемник] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные[ИмяЭлемента], "ЕдиницаИзмерения");
	КонецЕсли;

КонецПроцедуры        

&НаСервереБезКонтекста
Функция ОпределитьХарактеристикиИспользуются(Номенклатура)
	Возврат	УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ХарактеристикиИспользуются(Номенклатура);
КонецФункции

&НаКлиенте
Процедура ЗаменаНаАналогиПриАктивизацииСтроки(Элемент)
	УстановитьОтборПриемникаАналогов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПриемникаАналогов()
	
	Если Элементы.ЗаменаНаАналоги.ТекущиеДанные = Неопределено Тогда
		Элементы.ЗаменаНаАналогиПриемник.ОтборСтрок = Неопределено;
	Иначе
		Элементы.ЗаменаНаАналогиПриемник.ОтборСтрок = Новый ФиксированнаяСтруктура("Идентификатор", Элементы.ЗаменаНаАналоги.ТекущиеДанные.Идентификатор);    
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНаАналогиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Или Копирование Тогда    
		Элемент.ТекущиеДанные.Идентификатор = Новый УникальныйИдентификатор;  
		Элемент.ТекущиеДанные.Коэффициент = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНаАналогиПриемникПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда                
		ЗаполнитьЗначенияСвойств(Элементы.ЗаменаНаАналогиПриемник.ТекущиеДанные, Элементы.ЗаменаНаАналоги.ТекущиеДанные);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНаАналогиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьОтборПриемникаАналогов();      
	Строки = ЗаменаНаАналогиПриемник.НайтиСтроки(Новый Структура("Идентификатор", Элементы.ЗаменаНаАналоги.ТекущиеДанные.Идентификатор)); 
	Для Каждого Строка Из Строки Цикл 
		ЗаполнитьЗначенияСвойств(Строка, Элементы.ЗаменаНаАналоги.ТекущиеДанные, "НоменклатураИсточник, ХарактеристикаИсточник, ЕдиницаИзмеренияИсточник, Коэффициент"); 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
